@mnmozi Can you retest ? The schema refresh is in and I was able to test it once. 
```
 # awscc_mediaconnect_flow.SRT_HORIZONTAL will be created
  + resource "awscc_mediaconnect_flow" "SRT_HORIZONTAL" {
      + availability_zone      = (known after apply)
      + egress_ip              = (known after apply)
      + flow_arn               = (known after apply)
      + flow_availability_zone = (known after apply)
      + id                     = (known after apply)
      + maintenance            = (known after apply)
      + media_streams          = (known after apply)
      + name                   = "srt_horizontal"
      + source                 = {
          + decryption                         = (known after apply)
          + description                        = "This flow stream with the SRT protocol"
          + entitlement_arn                    = (known after apply)
          + gateway_bridge_source              = (known after apply)
          + ingest_ip                          = (known after apply)
          + ingest_port                        = 5000
          + max_bitrate                        = (known after apply)
          + max_latency                        = (known after apply)
          + max_sync_buffer                    = (known after apply)
          + media_stream_source_configurations = (known after apply)
          + min_latency                        = (known after apply)
          + name                               = "SRT"
          + protocol                           = "srt-listener"
          + sender_control_port                = (known after apply)
          + sender_ip_address                  = (known after apply)
          + source_arn                         = (known after apply)
          + source_ingest_port                 = (known after apply)
          + source_listener_address            = (known after apply)
          + source_listener_port               = (known after apply)
          + stream_id                          = (known after apply)
          + vpc_interface_name                 = (known after apply)
          + whitelist_cidr                     = "0.0.0.0/32"
        }
      + source_failover_config = (known after apply)
      + vpc_interfaces         = (known after apply)
    }
```